БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_Грузоперевозки_Клиент/Ext/Module.bsl
&НаКлиенте
Функция ВыполнитьДействие(УФ, СтруктураДействия, ПроцедураОбратногоВызова = Неопределено) Экспорт 
	
	ИмяКоманды = СтруктураДействия.Команда;
	Параметры = СтруктураДействия.Параметры;

	Отладка = УФ.Отладка;
	Если (Отладка) Тогда
		Сообщить("Клиент: """+ИмяКоманды+"""");
	КонецЕсли; 
	
	Если (ИмяКоманды = "/Предупреждение") Тогда 
		
		_УФК.ВывестиПредупреждение(Параметры);
		Возврат(Неопределено);
		
	ИначеЕсли (ИмяКоманды = "/ФормаЗаписать") Тогда
		
		Возврат(ЗаписатьФорму(УФ));
		
	#Область Бюджет 
	
	ИначеЕсли (ИмяКоманды = "/БюджетИнициализация") Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));
		
	ИначеЕсли (ИмяКоманды = "/БюджетВыбратьИзСписка") Тогда
		
		Возврат(БюджетВыбратьИзСписка(УФ));
		
	ИначеЕсли (ИмяКоманды = "/БюджетВыбрать") Тогда
		
		Возврат(БюджетВыбрать(УФ,ПроцедураОбратногоВызова));
		
	ИначеЕсли (ИмяКоманды = "/БюджетОбновить") Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));
		
	ИначеЕсли ИмяКоманды = "/БюджетРасходыОбновить"  Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));
		
	ИначеЕсли ИмяКоманды = "/БюджетДоходыОбновить" Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));
		
	ИначеЕсли (ИмяКоманды = "/БюджетДобавить") Тогда
		
		Возврат(БюджетДобавить(УФ,Параметры.Элемент,Параметры.Копирование));
		
	ИначеЕсли (ИмяКоманды = "/БюджетОткрыть") Тогда
		
		Возврат(БюджетОткрыть(УФ,Параметры));
		
	ИначеЕсли (ИмяКоманды = "/БюджетУдалить") Тогда
		
		Возврат(БюджетУдалить(УФ,Параметры,ПроцедураОбратногоВызова));
		
	ИначеЕсли (ИмяКоманды = "/БюджетКонтрагенты") Тогда
		
		Если (Параметры = Неопределено) Тогда
			Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетКонтрагентыПолучить"));
		Иначе
			Возврат(БюджетКонтрагенты(УФ,Параметры,ПроцедураОбратногоВызова));	
		КонецЕсли; 
		
	ИначеЕсли (ИмяКоманды = "/БюджетЗаполнить") Тогда
		
		Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетЗаполнитьОбработкиЗаполнения"));
		
	ИначеЕсли ИмяКоманды = "/БюджетЗаполнитьДоходыПоРасходам"  Тогда
		
		Возврат(БюджетЗаполнитьДоходыПоРасходам(УФ,Ложь, Ложь));
		
	ИначеЕсли ИмяКоманды = "/БюджетЗаполнитьДоходыПоРасходамДерево"  Тогда
		
		Возврат(БюджетЗаполнитьДоходыПоРасходам(УФ, Ложь ,Истина));
		
	ИначеЕсли  ИмяКоманды = "/БюджетЗаполнитьРасходыПоДоходам"  Тогда

		Возврат(БюджетЗаполнитьДоходыПоРасходам(УФ,Истина, Ложь));
	
	ИначеЕсли ИмяКоманды = "/БюджетЗаполнитьРасходыПоДоходамДерево"  Тогда
		
		Возврат(БюджетЗаполнитьДоходыПоРасходам(УФ,Истина ,Истина));
		
	ИначеЕсли ИмяКоманды = "/БюджетРасходыПересчитатьПоКурсу" Тогда
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
		Возврат(ПересчетСтатейБюджетаПоКурсу(УФ, ВидСтатьи, ПроцедураОбратногоВызова));
		
	ИначеЕсли ИмяКоманды = "/БюджетРасходыДеревоПересчитатьПоКурсу" Тогда
		
		СтрокаТаблицы = УФ.БюджетРасходыДерево.НайтиПоИдентификатору(УФ.Элементы.БюджетРасходыДерево.ТекущаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаРодитель  =  СтрокаТаблицы.ПолучитьРодителя();
			Если   СтрокаРодитель <> Неопределено Тогда
				Грузоперевозка  = СтрокаРодитель.Контрагент;
			Иначе
				Грузоперевозка  = СтрокаТаблицы.Контрагент;
			КонецЕсли;
		Конецесли;

		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
		Возврат(ПересчетСтатейБюджетаПоКурсу(УФ, ВидСтатьи, ПроцедураОбратногоВызова,Грузоперевозка));
		
	ИначеЕсли ИмяКоманды = "/БюджетДоходыПересчитатьПоКурсу"  Тогда
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы");
		Возврат(ПересчетСтатейБюджетаПоКурсу(УФ, ВидСтатьи, ПроцедураОбратногоВызова));
		
	ИначеЕсли ИмяКоманды = "/БюджетДоходыДеревоПересчитатьПоКурсу" Тогда
		
		СтрокаТаблицы = УФ.БюджетДоходыДерево.НайтиПоИдентификатору(УФ.Элементы.БюджетДоходыДерево.ТекущаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаРодитель  =  СтрокаТаблицы.ПолучитьРодителя();
			Если   СтрокаРодитель <> Неопределено Тогда
				Грузоперевозка  = СтрокаРодитель.Контрагент;
			Иначе
				Грузоперевозка  = СтрокаТаблицы.Контрагент;
			КонецЕсли;
		Конецесли;

		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
		Возврат(ПересчетСтатейБюджетаПоКурсу(УФ, ВидСтатьи, ПроцедураОбратногоВызова,Грузоперевозка));
		
	#КонецОбласти 
	
	#Область Финансы
	
	ИначеЕсли (ИмяКоманды = "/ФинансыОбновить") Тогда 
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыРасходыОбновить") Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыТранспортОбновить") Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыДоходыОбновить") Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));	
		
	ИначеЕсли (ИмяКоманды = "/ФинансыДобавить") Тогда
		
		Возврат(ФинансыДобавить(УФ,Параметры.Элемент,Параметры.Копирование));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыОткрыть") Тогда
		
		Возврат(ФинансыОткрыть(УФ,Параметры));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыУдалить") Тогда
		
		Возврат(ФинансыУдалить(УФ,Параметры, ПроцедураОбратногоВызова));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыРасходыОтобразитьСтатьи") Тогда
		
		Возврат(ФинансыРасходыОтобразитьСтатьи(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыТранспортОтобразитьСтатьи") Тогда
		
		Возврат(ФинансыТраснпортОтобразитьСтатьи(УФ));

	ИначеЕсли (ИмяКоманды = "/ФинансыДоходыОтобразитьСтатьи") Тогда
		
		Возврат(ФинансыДоходыОтобразитьСтатьи(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыРасходыДобавитьПоБюджету") Тогда
		
		Возврат(ФинансыРасходыДобавитьПоБюджету(УФ, ПроцедураОбратногоВызова));
		
	ИначеЕсли (ИмяКоманды = "/ФинансыДоходыДобавитьПоБюджету") Тогда
		
		Возврат(ФинансыДоходыДобавитьПоБюджету(УФ,ПроцедураОбратногоВызова));
		
	#КонецОбласти 
	
	#Область Декларации
	
	ИначеЕсли (ИмяКоманды = "/ДекларацииОбновить") Тогда 
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды));

	ИначеЕсли (ИмяКоманды = "/ДекларацииОткрыть") Тогда
		
		Возврат(ДекларацииОткрыть(УФ,Параметры));
	
	#КонецОбласти
	
	#Область Параметры 
		
	ИначеЕсли (ИмяКоманды = "/ПерезаполнитьПараметрыПоШаблону") Тогда
		
		Возврат(ПерезаполнитьПараметрыПоШаблону(УФ, ПроцедураОбратногоВызова));
		
	ИначеЕсли (ИмяКоманды = "/ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита") Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Грузоперевозки","сервер",ИмяКоманды,Параметры));
		
	ИначеЕсли (ИмяКоманды = "/ПерезаполнитьПредопределенныеПараметры") Тогда
		
		// проксируется на сервер
		Возврат(ПерезаполнитьПредопределенныеПараметры(УФ,Параметры));
	
	ИначеЕсли (ИмяКоманды = "/ДеревоПараметровСвернутьВсе") Тогда
		
		// проксируется на сервер
		Возврат(ДеревоПараметровСвернутьВсе(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ДеревоПараметровРазвернутьВсе") Тогда
		
		// проксируется на сервер
		Возврат(ДеревоПараметровРазвернутьВсе(УФ));
		
	ИначеЕсли (ИмяКоманды = "/СохранитьСостояниеСвертки") Тогда
		
		// проксируется на сервер
		Возврат(СохранитьСостояниеСвертки(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ВосстановитьСостояниеСвертки") Тогда
		
		// проксируется на сервер
		Возврат(ВосстановитьСостояниеСвертки(УФ));
		
	#КонецОбласти 
		
	#Область Отчеты 
	
	ИначеЕсли (ИмяКоманды = "/ОтчетПоГрузоперевозке") Тогда
		
		Возврат(ОтчетПоГрузоперевозке(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ОтчетНеперевыставленныеЗатраты") Тогда
		
		Возврат(ОтчетНеперевыставленныеЗатраты(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ОтчетПланФакторныйАнализБюджета") Тогда
		
		Возврат(ОтчетПланФакторныйАнализБюджета(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ОтчетНеактированныеВходящиеСчета") Тогда
		
		Возврат(ОтчетНеактированныеВходящиеСчета(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ОтчетНеактированныеИсходящиеСчета") Тогда
		
		Возврат(ОтчетНеактированныеИсходящиеСчета(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ОтчетАнализПрибыли") Тогда

		Возврат(ОтчетАнализПрибыли(УФ));
		
	#КонецОбласти 
	
	ИначеЕсли (ИмяКоманды = "/ИзменитьДатуЗакрытия") Тогда
		
		Возврат(ИзменитьДатуЗакрытия(УФ, ПроцедураОбратногоВызова));
		
	ИначеЕсли (ИмяКоманды = "/ОтображениеПримечания") Тогда
		
		Возврат(ОтображениеПримечания(УФ));
	
	ИначеЕсли (ИмяКоманды = "/Предупреждение") Тогда 
		
		_УФК.ВывестиПредупреждение(Параметры);
		Возврат(Неопределено);
		
	Иначе 
		
		Сообщить("Клиент: неизвестная команда """+ИмяКоманды+"""");
		Возврат(Неопределено);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ФормаГрузоперевозки(УФ)
	// --- 
	
	Возврат( УФ.ИмяФормы = "Справочник.CW_Грузоперевозки.Форма.ФормаЭлемента" );
	
	// --- 
КонецФункции

&НаКлиенте
Функция ФормаЗаказа(УФ)
	// --- 
	
	Возврат( УФ.ИмяФормы = "Справочник.CW_Заказы.Форма.ФормаЭлемента" );
	
	// --- 
КонецФункции

&НаКлиенте
Функция ФормаЗаявки(УФ)
	// --- 
	
	Возврат( УФ.ИмяФормы = "Справочник.CW_Заявки.Форма.ФормаЭлемента" );
	
	// --- 
КонецФункции


// ---------------------------------------------------------------------------- 

#Область ПерезаполнениеПараметровПоШаблону 

&НаКлиенте
Функция ПерезаполнитьПараметрыПоШаблону(УФ, ПроцедураОбратногоВызова)
	// --- 
	
	Если (УФ.ГруппаПользователя.Пустая()) Тогда
		
		_УФК.ВывестиПредупреждение("Для возможности заполнения параметров необходимо произвести настройку прав доступа");
		Возврат(Неопределено);
		
	КонецЕсли; 
	
	// удаляем параметры, которых нет в текущем типе г/п
	ПОВ_Удаление = Новый ОписаниеОповещения("ОбработкаУдаленияНетиповыхПараметров",ЭтотОбъект, Новый Структура("ПОВ",ПроцедураОбратногоВызова));
	УдалятьНетиповые = Ложь;
	Если (УФ.Объект.ПараметрыГрузоперевозки.Количество() = 0) Тогда
		
		УдалятьНетиповые = Истина;
		ВыполнитьОбработкуОповещения(ПОВ_Удаление,УдалятьНетиповые);
		
	Иначе
		
		ПОВ_ВопросУдаления = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияНетиповыхПараметров",ЭтотОбъект,Новый Структура("ПОВ",ПОВ_Удаление));
		ПоказатьВопрос(ПОВ_ВопросУдаления,"Параметры, не соответствующие типу перевозки, будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаУдаленияНетиповыхПараметров(Ответ, ДополнительныеПараметры) Экспорт
 	// --- 
	
	УдалятьНетиповые = Ложь;
	Если Ответ=КодВозвратаДиалога.Да Тогда
		
		УдалятьНетиповые=Истина;
		
	КонецЕсли;  
	// --- 
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,УдалятьНетиповые);
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаУдаленияНетиповыхПараметров(УдалятьНетиповые, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (УдалятьНетиповые) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/УдалитьНетиповыеПараметры"));
		
	КонецЕсли;  
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

&НаКлиенте
Функция СохранитьСостояниеСвертки(УФ)
	// --- 
	
	УФ.СостояниеСвертки.Очистить();
	Для каждого Стр Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
		
		УФ.СостояниеСвертки.Добавить(Стр.Параметр,,УФ.Элементы.ДеревоПараметров.Развернут(Стр.ПолучитьИдентификатор()));
		
	КонецЦикла; 
	
	Возврат(Неопределено);
	
	// --- 
КонецФункции

&НаКлиенте
Функция ВосстановитьСостояниеСвертки(УФ)
	// --- 
	
	Если УФ.ТребуетсяВосстановитьСостояниеСвертки Тогда
		
		УФ.ТребуетсяВосстановитьСостояниеСвертки=Ложь;
		
		Для каждого Стр Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
			
			СтрокаСостояния = УФ.СостояниеСвертки.НайтиПоЗначению(Стр.Параметр);
			Если СтрокаСостояния <> Неопределено Тогда
				
				Разворачивать = СтрокаСостояния.Пометка;
				Если Разворачивать = Неопределено Тогда
					
					Разворачивать = Истина;
					
				КонецЕсли; 
				Если Разворачивать Тогда
					
					УФ.Элементы.ДеревоПараметров.Развернуть(Стр.ПолучитьИдентификатор());
					
				КонецЕсли; 
				
			Иначе
				
				УФ.Элементы.ДеревоПараметров.Развернуть(Стр.ПолучитьИдентификатор());
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат(Неопределено);
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Функция ПерезаполнитьПредопределенныеПараметры(УФ,Параметры)
	// --- 
	
	ЭтаФорма = УФ;
	Элементы=УФ.Элементы;
	Объект = УФ.Объект;
	
	Структурапараметров = Новый Структура("ИмяРеквизита,ЗначениеРеквизита",ЭтаФорма.ТекущийЭлемент.Имя,Объект[ЭтаФорма.ТекущийЭлемент.Имя]);
	
	Возврат(_УФКС.СД("Грузоперевозки","сервер","/ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита",Структурапараметров));
		
	// --- 
КонецФункции

// --- 

&НаКлиенте
Функция ДеревоПараметровСвернутьВсе(УФ)
	
	Для каждого Стр Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
		
		УФ.Элементы.ДеревоПараметров.Свернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ДеревоПараметровРазвернутьВсе(УФ)
	
	Для каждого Стр Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
		
		УФ.Элементы.ДеревоПараметров.Развернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецФункции

&НаКлиенте
Функция ИзменитьДатуЗакрытия(УФ, ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияДатыЗакрытия",ЭтотОбъект,Новый Структура("ПОВ",ПроцедураОбратногоВызова));
	ПФ = Новый Структура("ДатаЗакрытия,Аналитика",УФ.ДатаЗакрытия,УФ.Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.CW_УстановкаДатыБлокировкиДокументов",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияДатыЗакрытия(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/ОбновитьДатуЗакрытия"));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ОтображениеПримечания(УФ)
	// --- 
	
	Элементы = УФ.Элементы;
	
	Если Элементы.Примечание.Видимость Тогда
		
		Элементы.Примечание.Видимость = Ложь;
		
	Иначе
		
		Элементы.Примечание.Видимость = Истина;
		
	КонецЕсли; 
	
	Если ФормаГрузоперевозки(УФ) тогда
		
		Элементы.ДеревоПараметровОтображениеКомментария.Пометка = Элементы.Примечание.Видимость;
		
	ИначеЕсли ФормаЗаказа(УФ) Тогда
		
		Элементы.ЖурналФорма_ОтображениеПримечания.Пометка = Элементы.Примечание.Видимость;
	
	КонецЕсли;
	
	// --- 
КонецФункции

#Область Бюджет 

&НаКлиенте
Функция БюджетДобавить(УФ,Элемент, Копирование)
	
	Параметры 		= Новый Структура();
	РеквизитТаблица = Элемент.Имя;
	Грузоперевозка  = Неопределено;
	ЭтоДерево 		= Ложь;

	Если Элемент.Имя = "БюджетРасходы" или Элемент.Имя =  "БюджетРасходыДерево" Тогда
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
		
		Если Элемент.Имя =  "БюджетРасходыДерево" и Не Элемент.ТекущаяСтрока = Неопределено Тогда
			ЭтоДерево = истина;
			СтрокаТаблицы = УФ["БюджетРасходыДерево"].НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаРодитель  =  СтрокаТаблицы.ПолучитьРодителя();
				Если   СтрокаРодитель <> Неопределено Тогда
					Грузоперевозка  = СтрокаРодитель.Контрагент;
				Иначе
					Грузоперевозка  = СтрокаТаблицы.Контрагент;
				КонецЕсли;
			Конецесли;
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "БюджетДоходы" или  Элемент.Имя =  "БюджетДоходыДерево"  Тогда 
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"); 
		
		Если Элемент.Имя =  "БюджетДоходыДерево" и Не Элемент.ТекущаяСтрока = Неопределено Тогда
			ЭтоДерево = истина;
			СтрокаТаблицы = УФ["БюджетДоходыДерево"].НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаРодитель  =  СтрокаТаблицы.ПолучитьРодителя();
				Если   СтрокаРодитель <> Неопределено Тогда
					Грузоперевозка  = СтрокаРодитель.Контрагент;
				Иначе
					Грузоперевозка  = СтрокаТаблицы.Контрагент;
				КонецЕсли;
			Конецесли;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если (ФормаГрузоперевозки(УФ)) Тогда
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("ВерсияБюджета",         УФ.БюджетТекущаяВерсия);
		СтруктураЗаполнения.Вставить("ВидСтатьиПланирования", ВидСтатьи);
		СтруктураЗаполнения.Вставить("Владелец",              УФ.Объект.Ссылка);

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТолькоПросмотр",        УФ.ТолькоПросмотр);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
		Если (Копирование) Тогда
			ЗначениеКопирования = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока).СтатьяСсылка;
			ПараметрыФормы.Вставить("ЗначениеКопирования ", ЗначениеКопирования);
		КонецЕсли; 
		
		Если ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Объект"				, УФ.Объект);
			СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
			СтруктураПараметров.Вставить("Контрагент"			, УФ.Объект.Клиент);
			
			СтруктураЗаполнения.Вставить("Контрагент",CW_Финансы.ВернутьПлательщика(СтруктураПараметров));
		КонецЕсли; 
		
		ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, Элемент);	
		
	ИначеЕсли (ФормаЗаявки(УФ)) Тогда 
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("ВерсияБюджета",         УФ.БюджетТекущаяВерсия);
		СтруктураЗаполнения.Вставить("ВидСтатьиПланирования", ВидСтатьи);
		СтруктураЗаполнения.Вставить("Владелец",              УФ.ВариантБюджета);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТолькоПросмотр",        УФ.ТолькоПросмотр);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
		Если (Копирование) Тогда
			ЗначениеКопирования = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока).СтатьяСсылка;
			ПараметрыФормы.Вставить("ЗначениеКопирования ", ЗначениеКопирования);
		КонецЕсли; 
		
		Если ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Объект"				, УФ.Объект);
			СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
			СтруктураПараметров.Вставить("Контрагент"			, УФ.Объект.Контрагент);
			
			СтруктураЗаполнения.Вставить("Контрагент",CW_Финансы.ВернутьПлательщика(СтруктураПараметров));
			
		КонецЕсли; 
		
		ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, Элемент);	
		
	ИначеЕсли (ФормаЗаказа(УФ)) Тогда 
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ЗаказСсылка",           УФ.Объект.Ссылка);
		ДанныеЗаполнения.Вставить("ВерсияБюджета",         УФ.БюджетТекущаяВерсия);
		ДанныеЗаполнения.Вставить("ВидСтатьиПланирования", ВидСтатьи);
		Если ВидСтатьи=ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			ДанныеЗаполнения.Вставить("Контрагент", УФ.Объект.Клиент);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("Грузоперевозка"	, Грузоперевозка);
		ДанныеЗаполнения.Вставить("Владелец"		, Грузоперевозка);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТолькоПросмотр"	, УФ.ТолькоПросмотр);
		
		Если ЭтоДерево Тогда
			ПараметрыФормы.Вставить("ЗначенияЗаполнения"	, ДанныеЗаполнения);
			ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, Элемент);
		Иначе
			ПараметрыФормы.Вставить("ЗначенияЗаполнения"	, ДанныеЗаполнения);
			ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаРедактированияГруппыСтатей", ПараметрыФормы, Элемент);
		КонецЕсли;
		
	КонецЕсли; 
	                 
КонецФункции


&НаКлиенте
Функция БюджетОткрыть(УФ,Параметры)
	// --- 
	ЭтоДерево 		= Ложь;
	Отказ			= Ложь;

	Элемент = Параметры.Элемент;
	РеквизитТаблица = Элемент.Имя;
	// --- 
	Если (Параметры.Свойство("ВыбраннаяСтрока")) Тогда
		
		СтрокаТаблицы = УФ[РеквизитТаблица].НайтиПоИдентификатору(Параметры.ВыбраннаяСтрока);
		
	Иначе
		
		СтрокаТаблицы = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		
	КонецЕсли; 
	
	Если Элемент.Имя = "БюджетРасходы"  Тогда
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
		
	Иначеесли Элемент.Имя =  "БюджетРасходыДерево" Тогда
		
		ВидСтатьи 		= ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
		ЭтоДерево 		= Истина;
		СтрокаРодитель  =  СтрокаТаблицы.ПолучитьРодителя();
		
		Если СтрокаРодитель = Неопределено Тогда
			Отказ = истина;
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "БюджетДоходы" Тогда 
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"); 
		
	ИначеЕсли Элемент.Имя =  "БюджетДоходыДерево"  Тогда 	
		
		ВидСтатьи 		= ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"); 
		ЭтоДерево 		= Истина;
		СтрокаРодитель  =  СтрокаТаблицы.ПолучитьРодителя();
		
		Если СтрокаРодитель = Неопределено Тогда
			Отказ = истина;
		КонецЕсли;
		
	КонецЕсли;  
	// --- 
	Если (ФормаГрузоперевозки(УФ)) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СтрокаТаблицы.СтатьяСсылка);
		ПараметрыФормы.Вставить("ТолькоПросмотр", УФ.БюджетУтвержден);
		// --- 
		ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	ИначеЕсли (ФормаЗаявки(УФ)) Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СтрокаТаблицы.СтатьяСсылка);
		ПараметрыФормы.Вставить("ТолькоПросмотр", УФ.БюджетУтвержден);
		// --- 
		ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	ИначеЕсли (ФормаЗаказа(УФ)) Тогда
		
		Если ЭтоДерево и не Отказ Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", СтрокаТаблицы.СтатьяСсылка);
			ПараметрыФормы.Вставить("ТолькоПросмотр", УФ.БюджетУтвержден);
			
			ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, Элемент);
			
		Иначе
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("ЗаказСсылка",           	УФ.Объект.Ссылка);
			ДанныеЗаполнения.Вставить("ВерсияБюджета",         	УФ.БюджетТекущаяВерсия);
			ДанныеЗаполнения.Вставить("ВидСтатьиПланирования", 	ВидСтатьи);
			ДанныеЗаполнения.Вставить("Контрагент",            	СтрокаТаблицы.Контрагент);
			ДанныеЗаполнения.Вставить("Номенклатура",          	СтрокаТаблицы.Номенклатура);
			ДанныеЗаполнения.Вставить("Валюта",                	СтрокаТаблицы.Валюта);
			ДанныеЗаполнения.Вставить("СтавкаНДС",             	СтрокаТаблицы.СтавкаНДС);
			ДанныеЗаполнения.Вставить("Организация",			СтрокаТаблицы.Организация);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения",		ДанныеЗаполнения);
			ПараметрыФормы.Вставить("ТолькоПросмотр", 			УФ.БюджетУтвержден);
			
			ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаРедактированияГруппыСтатей", ПараметрыФормы, Элемент);
			
		КонецЕсли;
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Функция БюджетУдалить(УФ, Параметры, ПроцедураОбратногоВызова)
	// --- 
	
	Элемент = Параметры.Элемент;
	РеквизитТаблица = Элемент.Имя;
	
	Если (УФ.БюджетУтвержден) Тогда
		
		Возврат(Неопределено);
		
	КонецЕсли; 
	
	Если (ФормаГрузоперевозки(УФ) ИЛИ ФормаЗаявки(УФ)) Тогда
		
		СтатьяСсылка = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока).СтатьяСсылка;
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияСтрокиБюджета",ЭтотОбъект,Новый Структура("Аналитика,ПОВ",СтатьяСсылка,ПроцедураОбратногоВызова));		
		
	Иначе
		Грузоперевозка = Неопределено;
		СтрокаТаблицы = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		
		Если Элемент.Имя = "БюджетРасходы" ИЛИ Элемент.Имя = "БюджетРасходыДерево" Тогда
			
			ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
			
		ИначеЕсли Элемент.Имя = "БюджетДоходы" ИЛИ Элемент.Имя = "БюджетДоходыДерево" Тогда 
			
			ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"); 
			
		КонецЕсли;
		
		ВыбранаГруппа = Ложь;
		Если Элемент.Имя = "БюджетРасходыДерево" ИЛИ   Элемент.Имя = "БюджетДоходыДерево" тогда
			СтрокаРодитель  =  СтрокаТаблицы.ПолучитьРодителя();
			Если СтрокаРодитель <> Неопределено Тогда
				Грузоперевозка  = СтрокаРодитель.Контрагент;
			Иначе
				Грузоперевозка  = СтрокаТаблицы.Контрагент;
				ВыбранаГруппа 	= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЗаказСсылка",           УФ.Объект.Ссылка);
		Отбор.Вставить("ВерсияБюджета",         УФ.БюджетТекущаяВерсия);
		Отбор.Вставить("ВидСтатьиПланирования", ВидСтатьи);
		Отбор.Вставить("Контрагент",            СтрокаТаблицы.Контрагент);
		Отбор.Вставить("Номенклатура",          СтрокаТаблицы.Номенклатура);
		Отбор.Вставить("Валюта",                СтрокаТаблицы.Валюта);
		Отбор.Вставить("СтавкаНДС",             СтрокаТаблицы.СтавкаНДС);
		Отбор.Вставить("Организация",           СтрокаТаблицы.Организация);
		Отбор.Вставить("Грузоперевозка",        Грузоперевозка);
		Отбор.Вставить("ВыбранаГруппа",         ВыбранаГруппа);
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияСтрокиБюджета",ЭтотОбъект,Новый Структура("Аналитика,ПОВ",Отбор,ПроцедураОбратногоВызова));		
		
	КонецЕсли; 
	
	ПоказатьВопрос(ПОВ,
			"Удалить строку?
			|Отменить удаление будет невозможно."
			, РежимДиалогаВопрос.ОКОтмена);
	
	// --- 
КонецФункции


&НаКлиенте
Процедура ОбработкаВопросаУдаленияСтрокиБюджета(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/БюджетУдалить",ДополнительныеПараметры.Аналитика));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Функция БюджетВыбратьИзСписка(УФ)
	// --- 
	
	пустаяКартинка = Новый Картинка;
	сз = Новый СписокЗначений;
	Для Каждого строкаТЗ Из УФ.БюджетВерсии Цикл
		сз.Добавить(строкаТЗ.ВерсияБюджета, , строкаТЗ.ЭтоУтвержденнаяВерсия, ?(строкаТЗ.ЭтоУтвержденнаяВерсия, БиблиотекаКартинок.CW_Замок, БиблиотекаКартинок.CW_ЭлементСписка));
	КонецЦикла;
	
	эл = УФ.ВыбратьИзСписка(сз, УФ.Элементы.БюджетТекущаяВерсия);
	Если (эл <> Неопределено) Тогда 
		УФ.БюджетТекущаяВерсия = эл.Значение;
		Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
	КонецЕсли;
	
	// --- 
КонецФункции

#Область ВыборВерсииБюджета 

&НаКлиенте
Функция БюджетВыбрать(УФ, ПроцедураОбратногоВызова)
	// --- 
	
	Если (ФормаЗаказа(УФ)) Тогда
		
		ПараметрыФормы = Новый Структура(
		"Заказ, Грузоперевозка, ВыбраннаяВерсия", 
		УФ.Объект.Ссылка,
		Неопределено,
		УФ.БюджетТекущаяВерсия
		);
		
	Иначе
		
		ПараметрыФормы = Новый Структура(
		"Заказ, Грузоперевозка, ВыбраннаяВерсия", 
		УФ.Объект.Заказ,
		УФ.Объект.Ссылка,
		УФ.БюджетТекущаяВерсия
		);
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияВерсииБюджета",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
	ПараметрыФормы.Вставить("ЭтоГрузоперевозка",ФормаГрузоперевозки(УФ));
	ОткрытьФорму("Справочник.CW_ВерсииБюджетов.Форма.ФормаУправленияВерсиями", ПараметрыФормы,УФ,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияВерсииБюджета(ВыбраннаяВерсия, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если ЗначениеЗаполнено(ВыбраннаяВерсия) И (ДополнительныеПараметры.УФ.БюджетТекущаяВерсия <> ВыбраннаяВерсия) Тогда 
		// выбрана другая версия
		ДополнительныеПараметры.УФ.БюджетТекущаяВерсия = ВыбраннаяВерсия;
		
	КонецЕсли;
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ВыборКонтрагентовПоБюджету 

&НаКлиенте
Функция БюджетКонтрагенты(УФ,Параметры, ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораКонтрагентовПоБюджету",ЭтотОбъект, Новый Структура("ПОВ",ПроцедураОбратногоВызова));
	ПФ = Новый Структура("Контрагенты,Владелец",Параметры,УФ.Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаСпискаКонтрагентовПоБюджету",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораКонтрагентовПоБюджету(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/БюджетКонтрагентыУстановить",Ответ));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

&НаКлиенте
Функция БюджетЗаполнить(УФ)
	// --- 
	
	
	
	// --- 
КонецФункции

&НаКлиенте
Функция БюджетЗаполнитьДоходыПоРасходам(УФ, ДоходыВРасходы = Ложь, РежимДерево = ложь)
	// --- 
	Грузоперевозка = Неопределено;
	
	Если  РежимДерево тогда
		Если ДоходыВРасходы Тогда
			Элемент = УФ.Элементы.БюджетДоходыДерево;
		Иначе
			Элемент = УФ.Элементы.БюджетРасходыДерево;
		КонецЕсли;
	Иначе
		Если ДоходыВРасходы Тогда
			Элемент = УФ.Элементы.БюджетДоходы;
		Иначе
			Элемент = УФ.Элементы.БюджетРасходы;
		КонецЕсли;
	КонецЕсли;
	РеквизитТаблица = Элемент.Имя;
	// --- 
	МассивСтрок = Новый Массив;
	
	
	Для каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		СтрокаТаблицы = УФ[РеквизитТаблица].НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если (СтрокаТаблицы <> Неопределено) Тогда
			МассивСтрок.Добавить(СтрокаТаблицы);	
		КонецЕсли; 
	КонецЦикла; 
	// --- 
	Если (МассивСтрок.Количество() <> 0) Тогда
		
		Если (ФормаГрузоперевозки(УФ)) Тогда
			
			МассивСсылок = Новый Массив;
			Для каждого СтрокаТаблицы Из МассивСтрок Цикл
				МассивСсылок.Добавить(СтрокаТаблицы.СтатьяСсылка);
			КонецЦикла; 
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Объект"			, УФ.Объект.Ссылка);
			ПараметрыЗаполнения.Вставить("ВерсияБюджета"	, УФ.БюджетТекущаяВерсия);
			ПараметрыЗаполнения.Вставить("МассивСсылок"		, МассивСсылок);
			ПараметрыЗаполнения.Вставить("ДоходыВРасходы"	, ДоходыВРасходы);
			ПараметрыЗаполнения.Вставить("РежимДерево"		, РежимДерево);
			
			Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетЗаполнитьДоходыПоРасходам",ПараметрыЗаполнения));	
			
		ИначеЕсли (ФормаЗаказа(УФ)) Тогда 
			
			Если РежимДерево тогда
				
				ПараметрыЗаполнения = Новый Структура;
				ПараметрыЗаполнения.Вставить("Объект"			, УФ.Объект.Ссылка);
				ПараметрыЗаполнения.Вставить("ВерсияБюджета"	, УФ.БюджетТекущаяВерсия);
				ПараметрыЗаполнения.Вставить("ДоходыВРасходы"	, ДоходыВРасходы);
				ПараметрыЗаполнения.Вставить("РежимДерево"		, РежимДерево);
				
				МассивСсылок = Новый Массив;
				
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					
					СтрокаРодитель  = СтрокаТаблицы.ПолучитьРодителя();
					Если СтрокаРодитель <> Неопределено тогда
						
						Если МассивСсылок.Найти(СтрокаТаблицы.СтатьяСсылка) = Неопределено Тогда
							МассивСсылок.Добавить(СтрокаТаблицы.СтатьяСсылка);
						КонецЕсли;
						
					Иначе //Это родитель
						
						мСтрокиТаблицы = СтрокаТаблицы.ПолучитьЭлементы();
						Для каждого СтрокаМассива Из мСтрокиТаблицы Цикл
							Если МассивСсылок.Найти(СтрокаМассива.СтатьяСсылка) = Неопределено Тогда
								МассивСсылок.Добавить(СтрокаМассива.СтатьяСсылка);
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ПараметрыЗаполнения.Вставить("МассивСсылок", МассивСсылок);
				
				Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетЗаполнитьДоходыПоРасходам",ПараметрыЗаполнения)); 
				
			Иначе
				
				
				МассивСтруктур = Новый Массив;
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					
					СтруктураСтроки = Новый Структура();
					СтруктураСтроки.Вставить("Заказ",		           	УФ.Объект.Ссылка);
					СтруктураСтроки.Вставить("ВерсияБюджета",         	УФ.БюджетТекущаяВерсия);
					СтруктураСтроки.Вставить("Номенклатура",          	СтрокаТаблицы.Номенклатура);
					СтруктураСтроки.Вставить("Валюта",                	СтрокаТаблицы.Валюта);
					СтруктураСтроки.Вставить("СтавкаНДС",             	СтрокаТаблицы.СтавкаНДС);
					СтруктураСтроки.Вставить("Организация",				СтрокаТаблицы.Организация);
					СтруктураСтроки.Вставить("Контрагент",            	СтрокаТаблицы.Контрагент);
					
					СтруктураСтроки.Вставить("Грузоперевозка"			, Неопределено);
					СтруктураСтроки.Вставить("ГрузоперевозкаВыбрана"	, Ложь);
					
					МассивСтруктур.Добавить(СтруктураСтроки);
					
				КонецЦикла; 
				
				ПараметрыЗаполнения = Новый Структура;
				ПараметрыЗаполнения.Вставить("Объект"				, УФ.Объект.Ссылка);
				ПараметрыЗаполнения.Вставить("ВерсияБюджета"		, УФ.БюджетТекущаяВерсия);
				ПараметрыЗаполнения.Вставить("МассивСсылок"			, МассивСтруктур);
				ПараметрыЗаполнения.Вставить("ДоходыВРасходы"		, ДоходыВРасходы);
				ПараметрыЗаполнения.Вставить("РежимДерево"		, РежимДерево);
				
				// --- 
				Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетЗаполнитьДоходыПоРасходам",ПараметрыЗаполнения));
				
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли; 	
	
	// --- 
КонецФункции

&НаКлиенте
Функция ПересчетСтатейБюджетаПоКурсу(УФ, ВидСтатьиБюджета, ПроцедураОбратногоВызова, Грузоперевозка = Неопределено)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДатыКурса",ЭтотОбъект, Новый Структура("ПОВ,ВидСтатьиБюджета,Грузоперевозка",ПроцедураОбратногоВызова, ВидСтатьиБюджета,Грузоперевозка)); 
	
	ДатаКурса = ТекущаяДата();
	ПоказатьВводДаты(ПОВ, ДатаКурса, "Дата курса", ЧастиДаты.Дата);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораДатыКурса(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> Дата(1,1,1)) Тогда
			
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/ПересчетСтатейБюджетаПоКурсу",Новый Структура("Грузоперевозка,ВидСтатьиБюджета,ДатаКурса,ТипКурсаВалюты",ДополнительныеПараметры.Грузоперевозка,ДополнительныеПараметры.ВидСтатьиБюджета,Ответ,1)));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

&НаКлиенте
Функция ЗаписатьФорму(УФ)
	// --- 
	
	УФ.Записать();
	
	// --- 
КонецФункции
  

// ---------------------------------------------------------------------------- 

#Область Финансы 

&НаКлиенте
Функция ФинансыДобавить(УФ,Элемент, Копирование)
	// --- 
	
	РеквизитТаблица = Элемент.Имя;
	Если (Элемент.Имя = "ФинансыРасходы") Тогда
		
		ИмяФормы = "Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта";
		
	ИначеЕсли (Элемент.Имя = "ФинансыДоходы") Тогда 
		
		ИмяФормы = "Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта";
		
	КонецЕсли; 
		
	// --- 
	ПараметрыФормы = Новый Структура;
	Если Копирование Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", УФ[РеквизитТаблица].НайтиПоИдентификатору(УФ.Элементы[РеквизитТаблица].ТекущаяСтрока).Документ);
	Иначе
		ПараметрыФормы.Вставить("Основание", УФ.Объект.Ссылка);
	КонецЕсли; 
	
	ФормаДокумента = ОткрытьФорму(ИмяФормы,ПараметрыФормы,Элемент);
	
	// --- 
КонецФункции

&НаКлиенте
Функция ФинансыОткрыть(УФ, Параметры)
	// --- 
	
	Элемент = Параметры.Элемент;
	РеквизитТаблица = Элемент.Имя;
	// --- 
	Если (Параметры.Свойство("ВыбраннаяСтрока")) Тогда
		
		Документ = УФ[РеквизитТаблица].НайтиПоИдентификатору(Параметры.ВыбраннаяСтрока).Документ;
		
	Иначе
		
		Документ = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока).Документ;
		
	КонецЕсли; 
	Если (Элемент.Имя = "ФинансыРасходы") Тогда
		
		ИмяФормы = "Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта";
		
	ИначеЕсли (Элемент.Имя = "ФинансыДоходы") Тогда 
		
		ИмяФормы = "Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта";
		
	КонецЕсли; 
	
	Попытка
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Документ);
		ОткрытьФорму(ИмяФормы, ПараметрыФормы,Элемент);
	Исключение
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаКлиенте
Функция ФинансыУдалить(УФ,Параметры, ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаОтветаУдаленияДокументаФинансов",ЭтотОбъект, Новый Структура("УФ,ПОВ,Параметры",УФ,ПроцедураОбратногоВызова, Параметры));
	ПоказатьВопрос(ПОВ,"Установить пометку удаления?",РежимДиалогаВопрос.ДаНет);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаОтветаУдаленияДокументаФинансов(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		Элемент = ДополнительныеПараметры.Параметры.Элемент;
		РеквизитТаблица = Элемент.Имя;
		// --- 
		Документ = ДополнительныеПараметры.УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока).Документ;
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/ФинансыУдалить",Документ));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Функция ФинансыТраснпортОтобразитьСтатьи(УФ)
	// ---    
	
	Если УФ.ФинансыТранспортОтображатьПостатейно Тогда
		УФ.ФинансыТранспортОтображатьПостатейно = Ложь;
	Иначе
		УФ.ФинансыТранспортОтображатьПостатейно = Истина;
	КонецЕсли; 
	
	Настройка = Новый структура("ОтображатьПостатейно", УФ.ФинансыТранспортОтображатьПостатейно); 
	CW_Грузоперевозки_Сервер._СохранитьЗначение("ОтображатьПостатейно", Настройка); 
	
	УФ.Элементы.Форма_ФинансыТранспортОтобразитьСтатьи.Пометка = УФ.ФинансыТранспортОтображатьПостатейно;
	Возврат(_УФКС.СД("Грузоперевозки","сервер","/ФинансыТранспортОбновить"));
	
	// --- 
КонецФункции


&НаКлиенте
Функция ФинансыРасходыОтобразитьСтатьи(УФ)
	// ---    
	
	Если УФ.ФинансыРасходыОтображатьПостатейно Тогда
		УФ.ФинансыРасходыОтображатьПостатейно = Ложь;
	Иначе
		УФ.ФинансыРасходыОтображатьПостатейно = Истина;
	КонецЕсли; 
	
	Настройка = Новый структура("ОтображатьПостатейно", УФ.ФинансыРасходыОтображатьПостатейно); 
	CW_Грузоперевозки_Сервер._СохранитьЗначение("ОтображатьПостатейно", Настройка); 
	
	УФ.Элементы.Форма_ФинансыРасходыОтобразитьСтатьи.Пометка = УФ.ФинансыРасходыОтображатьПостатейно;
	Возврат(_УФКС.СД("Грузоперевозки","сервер","/ФинансыРасходыОбновить"));
	
	// --- 
КонецФункции

&НаКлиенте
Функция ФинансыДоходыОтобразитьСтатьи(УФ)
	// --- 
	
	Если УФ.ФинансыДоходыОтображатьПостатейно Тогда
		УФ.ФинансыДоходыОтображатьПостатейно = Ложь;
	Иначе
		УФ.ФинансыДоходыОтображатьПостатейно = Истина;
	КонецЕсли; 
	
	Настройка = Новый структура("ОтображатьПостатейно", УФ.ФинансыДоходыОтображатьПостатейно); 
	CW_Грузоперевозки_Сервер._СохранитьЗначение("ОтображатьПостатейно", Настройка); 
	
	УФ.Элементы.Форма_ФинансыДоходыОтобразитьСтатьи.Пометка = УФ.ФинансыДоходыОтображатьПостатейно;
	Возврат(_УФКС.СД("Грузоперевозки","сервер","/ФинансыДоходыОбновить")); 
	
	// --- 
КонецФункции

&НаКлиенте
Функция ФинансыРасходыДобавитьПоБюджету(УФ, ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияРасходовПоБюджету",ЭтотОбъект, Новый Структура("ПОВ",ПроцедураОбратногоВызова));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСсылка", УФ.Объект.Ссылка);
	ПараметрыФормы.Вставить("ВидДоговора",ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаЗаполненияПоБюджету", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаДобавленияРасходовПоБюджету(БылиИзменения, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (БылиИзменения = Неопределено) Тогда
		БылиИзменения = Ложь;
	КонецЕсли; 
	Если (БылиИзменения) Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/ФинансыРасходыОбновить"));
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Функция ФинансыДоходыДобавитьПоБюджету(УФ, ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияДоходовПоБюджету",ЭтотОбъект, Новый Структура("ПОВ",ПроцедураОбратногоВызова));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСсылка", УФ.Объект.Ссылка);
	ПараметрыФормы.Вставить("ВидДоговора",ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаЗаполненияПоБюджету", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаДобавленияДоходовПоБюджету(БылиИзменения, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (БылиИзменения = Неопределено) Тогда
		БылиИзменения = Ложь;
	КонецЕсли; 
	Если (БылиИзменения) Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Грузоперевозки","сервер","/ФинансыДоходыОбновить"));
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  
#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область Декларации 

&НаКлиенте
Функция ДекларацииОткрыть(УФ, Параметры)
	// --- 
	
	Если НЕ Параметры = Неопределено Тогда
		
		Элемент = Параметры.Элемент;
		РеквизитТаблица = Элемент.Имя;
		// --- 
		Если (Параметры.Свойство("ВыбраннаяСтрока")) Тогда
			
			РасчетДТ = УФ[РеквизитТаблица].НайтиПоИдентификатору(Параметры.ВыбраннаяСтрока).РасчетДТ;
			ПроектДТ = УФ[РеквизитТаблица].НайтиПоИдентификатору(Параметры.ВыбраннаяСтрока).ПроектДТ; 
			
		Иначе
			
			РасчетДТ = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока).РасчетДТ;
			ПроектДТ = УФ[РеквизитТаблица].НайтиПоИдентификатору(Элемент.ТекущаяСтрока).ПроектДТ; 
			
		КонецЕсли; 
	Иначе
		
		Если УФ.ТекущийЭлемент.ТекущиеДанные = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли; 
		
		РасчетДТ = УФ.ТекущийЭлемент.ТекущиеДанные.РасчетДТ;
		ПроектДТ = УФ.ТекущийЭлемент.ТекущиеДанные.ПроектДТ;
		
	КонецЕсли; 
		
	Попытка
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", РасчетДТ);
		ПараметрыФормы.Вставить("Основание", ПроектДТ);
		ОткрытьФорму("Справочник.CW_РасчетыДТ.Форма.ФормаЭлемента", ПараметрыФормы,УФ);
	Исключение
	КонецПопытки; 
	
	// --- 
КонецФункции

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область Отчеты 

&НаКлиенте
Функция ОтчетПоГрузоперевозке(УФ)
	
	ПараметрыФормы = Новый Структура;
	СписокГП = Новый СписокЗначений;
	СписокГП.Добавить(УФ.Объект.Ссылка);
	ПараметрыФормы.Вставить("Грузоперевозки",СписокГП);
	ОткрытьФорму("Отчет.CW_ОтчетПоГрузоперевозке.Форма.ФормаОтчета",ПараметрыФормы);
	
КонецФункции

&НаКлиенте
Функция ОтчетНеперевыставленныеЗатраты(УФ)
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить("Контрагент");
	МассивГруппировок.Добавить("Номенклатура");
	МассивГруппировок.Добавить("ДокументЗатрат");
	Отбор = Новый Структура("Грузоперевозка", УФ.Объект.Ссылка);
	ПФ = Новый Структура("ВнешнийВызов,Отбор,Группировки", Истина, Отбор, МассивГруппировок);
	ОткрытьФорму("Отчет.CW_НеперевыставленныеЗатраты.Форма.ФормаОтчетаУправляемая", ПФ);
	
КонецФункции

&НаКлиенте
Функция ОтчетПланФакторныйАнализБюджета(УФ)
	
	ПараметрыФормы = Новый Структура;
	СписокГП = Новый СписокЗначений;
	СписокГП.Добавить(УФ.Объект.Ссылка);
	ПараметрыФормы.Вставить("Грузоперевозки",СписокГП);
	ПараметрыФормы.Вставить("ВерсияБюджета",УФ.БюджетТекущаяВерсия);
	ОткрытьФорму("Отчет.CW_ПланФакторныйАнализГрузоперевозок.Форма.ФормаОтчета",ПараметрыФормы,УФ);
	
КонецФункции

&НаКлиенте
Функция ОтчетНеактированныеВходящиеСчета(УФ)
	// --- 
	
	ПараметрыФормы = Новый Структура;
	Если (ТипЗнч(УФ.Объект.Ссылка) = Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
		ПараметрыФормы.Вставить("Грузоперевозка",УФ.Объект.Ссылка);
	ИначеЕсли (ТипЗнч(УФ.Объект.Ссылка) = Тип("СправочникСсылка.CW_Заказы")) Тогда 
		ПараметрыФормы.Вставить("Заказ",УФ.Объект.Ссылка);
	Иначе
		Возврат(Неопределено);
	КонецЕсли; 
	ОткрытьФорму("Отчет.CW_НеАктированыеВходящиеСчета.Форма.ФормаОтчета",ПараметрыФормы,УФ);
	
	// --- 
КонецФункции

&НаКлиенте
Функция ОтчетНеактированныеИсходящиеСчета(УФ)
	// --- 
	
	ПараметрыФормы = Новый Структура;
	Если (ТипЗнч(УФ.Объект.Ссылка) = Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
		ПараметрыФормы.Вставить("Грузоперевозка",УФ.Объект.Ссылка);
	ИначеЕсли (ТипЗнч(УФ.Объект.Ссылка) = Тип("СправочникСсылка.CW_Заказы")) Тогда 
		ПараметрыФормы.Вставить("Заказ",УФ.Объект.Ссылка);
	Иначе
		Возврат(Неопределено);
	КонецЕсли; 
	ОткрытьФорму("Отчет.CW_НеАктированыеИсходящиеСчета.Форма.ФормаОтчета",ПараметрыФормы,УФ);
	
	// --- 
КонецФункции  

&НаКлиенте
Функция ОтчетАнализПрибыли(УФ)
	// --- 
	
	ПараметрыФормы = Новый Структура;
	// --- 
	ПараметрыФормы.Вставить("ВнешнийВызов",Истина);
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Данные",1);
	Если (ТипЗнч(УФ.Объект.Ссылка) = Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
		ПараметрыОтчета.Вставить("Грузоперевозка",УФ.Объект.Ссылка);
	ИначеЕсли (ТипЗнч(УФ.Объект.Ссылка) = Тип("СправочникСсылка.CW_Заказы")) Тогда 
		ПараметрыОтчета.Вставить("Заказ",УФ.Объект.Ссылка);
	Иначе
		Возврат(Неопределено);
	КонецЕсли;
	ПараметрыОтчета.Вставить("ИсключатьВнутрихолдинговыеВзаиморасчеты",Истина);
	ПараметрыОтчета.Вставить("ВыводитьРасходыДоходы",Истина);
	// --- 
	ПараметрыФормы.Вставить("Параметры",ПараметрыОтчета);
	
	Показатели = Новый Массив;
	Показатели.Добавить("Всего");
	// --- 
	ПараметрыФормы.Вставить("Показатели",Показатели);
	
	Разделы = Новый Массив;
	Разделы.Добавить("План");
	Разделы.Добавить("Факт");
	Разделы.Добавить("Отклонение");
	// --- 
	ПараметрыФормы.Вставить("Разделы",Разделы);
	
	Группировки = Новый СписокЗначений;
	Группировки.Добавить("Грузоперевозка.Клиент","Грузоперевозка.Клиент");
	Группировки.Добавить("Грузоперевозка","Грузоперевозка");
	Группировки.Добавить("Номенклатура","Номенклатура");
	// --- 
	ПараметрыФормы.Вставить("Группировки",Группировки);
	
	// --- 
	ОткрытьФорму("Отчет.CW_АнализПрибылиПоГрузоперевозкам.Форма.ФормаОтчета",ПараметрыФормы,УФ,Истина);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОткытьОтчетАнализПрибылиПоГрузоперевозкам(Форма, Знач Грузоперевозки) Экспорт
	
	СписоркГрузоперевозок = Новый СписокЗначений;
	СписоркГрузоперевозок.ЗагрузитьЗначения(Грузоперевозки);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВнешнийВызов", Истина);   
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Ложь);   
	ПараметрыФормы.Вставить("Данные",			1);
	ПараметрыФормы.Вставить("Грузоперевозки", 	Грузоперевозки);
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Данные",			1);
	ПараметрыОтчета.Вставить("Грузоперевозки", 	СписоркГрузоперевозок);
	
	ПараметрыФормы.Вставить("Параметры", ПараметрыОтчета);
	
	Показатели = Новый Массив;
	ПараметрыФормы.Вставить("Показатели",Показатели);
	
	Разделы = Новый Массив;
	ПараметрыФормы.Вставить("Разделы",Разделы);
	
	Группировки = Новый СписокЗначений;
	ПараметрыФормы.Вставить("Группировки",Группировки);
	
	ОткрытьФорму("Отчет.CW_АнализПрибылиПоГрузоперевозкам.Форма.ФормаОтчета", ПараметрыФормы, Форма, Истина);

КонецПроцедуры 

#КонецОбласти 


&НаКлиенте
Функция ПолучитьСтруктуруИтоговТаблицыФормы(Форма, ИмяТаблицы) Экспорт
	
	ЭлементФормы 	= Форма.Элементы[ИмяТаблицы];  
	ИмяКолонки 		= ЭлементФормы.ТекущийЭлемент.Имя;  
	ТаблицаФормы 	= Форма[ИмяТаблицы];   

	Если ИмяТаблицы = "БюджетРасходы" Тогда
		
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "БюджетРасходы", "");
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "БюджетЗатраты", "");
		
	ИначеЕсли ИмяТаблицы = "БюджетРасходыДерево" Тогда 
		
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "БюджетРасходыДерево", "");  

	ИначеЕсли ИмяТаблицы = "БюджетДоходы" Тогда 
		
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "БюджетДоходы", "");
		
	ИначеЕсли ИмяТаблицы = "БюджетДоходыДерево" Тогда 
		
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "БюджетДоходыДерево", "");  

	ИначеЕсли ИмяТаблицы = "ФинансыРасходы" Тогда 
		
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "Затраты", "");
		
	ИначеЕсли ИмяТаблицы = "ФинансыДоходы" Тогда 
		
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "Доходы", "");
		
	КонецЕсли;   

	
	// массив строк отсутствует
	Попытка 
		ИдентификаторСтроки 	= ЭлементФормы.ВыделенныеСтроки[0];  
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	СтрокаТаблицы 			= ТаблицаФормы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗначениеЯчейки 			= СтрокаТаблицы[ИмяКолонки]; 
	
	Если ТипЗнч(ЗначениеЯчейки) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СуммаЗначений 		= 0;
	КоличествоЗначений  	= ЭлементФормы.ВыделенныеСтроки.Количество();
	МинимальноеЗначение 	= Неопределено;
	МаксимальноеЗначение 	= Неопределено;
	
	Если ТипЗнч(ТаблицаФормы) <> Тип("ДинамическийСписок") Тогда
		Для каждого ИдентификаторСтроки Из ЭлементФормы.ВыделенныеСтроки Цикл
			
			СтрокаТаблицы 	= ТаблицаФормы.НайтиПоИдентификатору(ИдентификаторСтроки);
			ЗначениеЯчейки 	= СтрокаТаблицы[ИмяКолонки]; 
			
			Если ТипЗнч(ЗначениеЯчейки) = Тип("Число") Тогда
				СуммаЗначений = СуммаЗначений + ЗначениеЯчейки;
			КонецЕсли; 
			
			Если  МинимальноеЗначение = Неопределено Тогда
				МинимальноеЗначение = ЗначениеЯчейки;
			Иначе
				МинимальноеЗначение =  Мин(ЗначениеЯчейки, МинимальноеЗначение); 
			КонецЕсли;
			
			Если  МаксимальноеЗначение = Неопределено Тогда
				МаксимальноеЗначение = ЗначениеЯчейки;
			Иначе
				МаксимальноеЗначение = Макс(ЗначениеЯчейки, МинимальноеЗначение); ; 
			КонецЕсли;
			
		КонецЦикла;  
	КонецЕсли;
	
	СреднееЗначение		= ?(КоличествоЗначений=0,0, СуммаЗначений/КоличествоЗначений);
	
	СтркутраПараметров = Новый Структура;
	СтркутраПараметров.Вставить("КоличествоЗначений"	, КоличествоЗначений);
	СтркутраПараметров.Вставить("СреднееЗначение"		, СреднееЗначение);
	СтркутраПараметров.Вставить("МинимальноеЗначение"	, МинимальноеЗначение);
	СтркутраПараметров.Вставить("МаксимальноеЗначение"	, МаксимальноеЗначение);
	СтркутраПараметров.Вставить("СуммаЗначений"			, СуммаЗначений);
	
	Возврат СтркутраПараметров
	
КонецФункции

Процедура ОткрытьФормуВычисленияЗначений(Знач СтркутраПараметров, Форма) Экспорт
	
	Если СтркутраПараметров = Неопределено Тогда
		ПоказатьПредупреждение(, "По выбранной колонке невозможно просуммировать значения!");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.CW_ВычислитьЗначениеЖурнала",СтркутраПараметров, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
